data/JAVA/Generate_Excel/data/soaprequest.xml

<soapenv:Envelope xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:nsrm="http://xmlns.oracle.com/communications/inventory/webservice/nsrm" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">																		
	<soapenv:Header>																		
		<wsse:Security>																	
			<wsse:UsernameToken>																
				<wsse:Username>uim_admin</wsse:Username>															
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">passwst1n</wsse:Password>															
			</wsse:UsernameToken>																
		</wsse:Security>																	
	</soapenv:Header>																		
	<soapenv:Body>																		
		<nsrm:importEntityRequestType>																				
			<octet/>																
		</nsrm:importEntityRequestType>																	
	</soapenv:Body>																		
</soapenv:Envelope>
